In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame({'total_bill': [16.99, 10.34, 23.68, 23.68, 24.59],
                   'tip': [1.01, 1.66, 3.50, 3.31, 3.61],
                   'sex': ['Female', 'Male', 'Male', 'Male', 'Female']})

In [6]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [8]:
df[['tip','sex']]

    tip     sex
0  1.01  Female
1  1.66    Male
2  3.50    Male
3  3.31    Male
4  3.61  Female

In [9]:
df[0:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male

In [10]:
df.loc[2]

total_bill    23.68
tip             3.5
sex            Male
Name: 2, dtype: object

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df.columns[:1]

Index(['total_bill'], dtype='object')

In [17]:
df

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       23.68  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

In [20]:
df.loc[1:3,['tip','sex']]

    tip   sex
1  1.66  Male
2  3.50  Male
3  3.31  Male

In [23]:
df.iloc[1:3, 1:3]

    tip   sex
1  1.66  Male
2  3.50  Male

In [25]:
df.iloc[1:4, [0,2]]

   total_bill   sex
1       10.34  Male
2       23.68  Male
3       23.68  Male